/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	ポーズオブジェ実装
	---------------------------------------
	BgPause.cpp

	作成者	takagi

	変更履歴
	・2023/12/10 制作 takagi

========================================== */

// =============== インクルード ===================
#include "BgPause.h"	//自身のヘッダ

// =============== 定数定義 ===================
const float AMPITUDE(25.0f);								//振幅
const float ANGLE_SPEED(DirectX::XMConvertToRadians(1.5f));	//単振動の角速度

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：const int& nWaitTime：待機時間
	----------------------------------------
	戻値：なし
=========================================== */
CBgPause::CBgPause(const int& nWaitTime)
	:m_fMoveAngle(0.0f)		//移動角
{
}

/* ========================================
	位置算出関数
	----------------------------------------
	内容：第一引数で受け取った位置を表す変数にズレを直接反映する。
	----------------------------------------
	引数1：TPos3d<float>& fPos：結果が格納される、最終目標位置の情報が入った変数
	----------------------------------------
	戻値：なし
=========================================== */
void CBgPause::CulculatePos(TPos3d<float>& fPos)
{
	// =============== 算出 ===================
	CPauseObj::CulculatePos(fPos);							//親の関数使用
	fPos.y = m_fReach.y + AMPITUDE * sinf(m_fMoveAngle);	//補完

	// =============== 更新 ===================
	m_fMoveAngle += ANGLE_SPEED;	//角更新
}
