/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	フェード用疑似カメラ定義
	------------------------------------
	CameraFade.h
	------------------------------------
	作成者	takagi

	変更履歴
	・2023/11/27 制作 takagi

========================================== */

#ifndef ___CAMERA_FADE_H___
#define ___CAMERA_FADE_H___

// =============== インクルード ===================
#include "Camera.h"	//親のヘッダ

// =============== クラス定義 =====================
class CCameraFade :public CCamera	//カメラ
{
public:
	// ===プロトタイプ宣言===
	void Update() {}	//更新
};	//疑似カメラ

#endif // !___CAMERA_FADE_H___