/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	エフェクト定義
	------------------------------------
	Effect.h
	------------------------------------
	作成者 takagi

	変更履歴
	・2023/11/09 作成 takagi

========================================== */

#ifndef __EFFECT_H__
#define __EFFECT_H__

// =============== インクルード ===================
#include "EmitterManager.h"	//メンバのヘッダ

// =============== クラス定義 =====================
class CEffect
{
protected:
	// ===メンバ変数宣言=====
	//pos定義
	CEmitterManager* m_pEmitterMng;	//エミッター管理
public:
	// ===プロトタイプ宣言===
	CEffect();						//コンストラクタ
	CEffect(const CEffect& Obj);	//コピーコンストラクタ
	~CEffect();						//デストラクタ
};	//パーティクル

#endif	//!__EFFECT_H__