/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	エミッター(パーティクル管理)定義
	------------------------------------
	Emitter.h
	------------------------------------
	作成者 takagi

	変更履歴
	・2023/11/09 作成 takagi

========================================== */

// =============== インクルード ===================
#include "Particle.h"	//メンバのヘッダ

#ifndef __EMITTER_H__
#define __EMITTER_H__

// =============== クラス定義 =====================
class CEmitter
{
protected:
	// ===メンバ変数宣言=====
	//pos定義
	CParticle* m_pParticle;	//パーティクル
public:
	// ===プロトタイプ宣言===
	CEmitter();						//コンストラクタ
	CEmitter(const CEmitter& Obj);	//コピーコンストラクタ
	~CEmitter();					//デストラクタ
};	//エミッター

#endif	//!__EMITTER_H__