/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	固定カメラ定義
	------------------------------------
	FixedCamera.h
	------------------------------------
	作成者	takagi

	変更履歴
	・2023/12/16 制作 takagi

========================================== */

#ifndef ___FIXED_CAMERA_H___
#define ___FIXED_CAMERA_H___

// =============== インクルード ===================
#include "Camera.h"	//親のヘッダ

// =============== クラス定義 =====================
class CFixedCamera :public CCamera	//カメラ
{
public:
	// ===プロトタイプ宣言===
	void Update();		//更新
};	//固定カメラ

#endif // !___FIXED_CAMERA_H___