/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	固定カメラ定義
	------------------------------------
	FixedCamera.h
	------------------------------------
	作成者	takagi

	変更履歴
	・2023/12/16 制作 takagi
	・2024/01/16 統一のため、インクルードガードの___を__に変更	takagi
	・2024/01/20 コメント改修 takagi
	・2024/01/21 コメント改修 takagi

========================================== */

#ifndef __FIXED_CAMERA_H__	//FixedCamera.hインクルードガード
#define __FIXED_CAMERA_H__

// =============== インクルード ===================
#include "Camera.h"	//親のヘッダ

// =============== クラス定義 =====================
class CFixedCamera :public CCamera	//カメラ
{
public:
	// ===プロトタイプ宣言===
	void Update();		//更新
};	//固定カメラ

#endif	//!__FIXED_CAMERA_H__