/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	Floor用cpp
	------------------------------------
	Floor.cpp
	------------------------------------
	作成者
		yamashita
	変更履歴
	・2023/11/16 h,作成 yamashita
	・2023/11/16 コンストラクタに頂点シェーダーとモデルの読み込みを追加 yamashita
	・2023/11/16 カメラのセット関数を作成 yamashita
========================================== */
#include "Floor.h"

/* ========================================
   関数：コンストラクタ
   ----------------------------------------
   内容：生成時に行う処理
   ----------------------------------------
   引数：なし
   ----------------------------------------
   戻値：なし
======================================== */
CFloor::CFloor()
	:m_pModel(nullptr)
	,m_pVS(nullptr)
	,m_pCamera(nullptr)
{
	//頂点シェーダ読み込み
	m_pVS = new VertexShader();
	if (FAILED(m_pVS->Load("Assets/Shader/VS_Model.cso"))) {
		MessageBox(nullptr, "VS_Model.cso", "Error", MB_OK);
	}
	//床のモデル読み込み
	m_pModel = new Model;
	if (!m_pModel->Load("Assets/Model/floor/floor_1.1.FBX", 1.0f, Model::XFlip)) {		//倍率と反転は省略可
		MessageBox(NULL, "floor", "Error", MB_OK);	//ここでエラーメッセージ表示
	}
	m_pModel->SetVertexShader(m_pVS);

	// レンダーターゲット、深度バッファの設定
	RenderTarget* pRTV = GetDefaultRTV();	//デフォルトで使用しているRenderTargetViewの取得
	DepthStencil* pDSV = GetDefaultDSV();	//デフォルトで使用しているDepthStencilViewの取得
	SetRenderTargets(1, &pRTV, pDSV);		//DSVがnullだと2D表示になる

	m_Transform.fPos = { 0.0f, 0.0f, 0.0f };	//ポジションの初期化
	m_Transform.fScale = { 1.0f, 1.0f, 1.0f };	//スケールの初期化
	m_Transform.fRadian = { 0.0f, 0.0f, 0.0f };	//回転角を初期化
}

/* ========================================
   関数：デストラクタ
   ----------------------------------------
   内容：終了時に行う処理
   ----------------------------------------
   引数：なし
   ----------------------------------------
   戻値：なし
======================================== */
CFloor::~CFloor()
{
	SAFE_DELETE(m_pModel);
	SAFE_DELETE(m_pVS);
}

/* ========================================
	アップデート関数
   ----------------------------------------
   内容：毎フレーム行う処理
   ----------------------------------------
   引数：なし
   ----------------------------------------
   戻値：なし
======================================== */
void CFloor::Update()
{
}

/* ========================================
   描画関数
   ----------------------------------------
   内容：オブジェクトの描画
   ----------------------------------------
   引数：なし
   ----------------------------------------
   戻値：なし
======================================== */
void CFloor::Draw()
{
	DirectX::XMFLOAT4X4 mat[3];

	mat[0] = m_Transform.GetWorldMatrixSRT();
	mat[1] = m_pCamera->GetViewMatrix();
	mat[2] = m_pCamera->GetProjectionMatrix();

	//-- 行列をシェーダーへ設定
	m_pVS->WriteBuffer(0, mat);

	//-- モデル表示
	if (m_pModel) {
		m_pModel->Draw();
	}
}

/* ========================================
   カメラセット関数
   ----------------------------------------
   内容：他のオブジェクトと同じカメラをセットする
   ----------------------------------------
   引数：なし
   ----------------------------------------
   戻値：なし
======================================== */
void CFloor::SetCamera(const CCamera * pCamera)
{
	m_pCamera = pCamera;
}
