/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	HPテクスチャ表示管理用ヘッダ
	------------------------------------
	HpManager.h
	------------------------------------
	作成者	仁枝潤哉

	変更履歴
	・2023/11/16 新規作成 仁枝潤哉

========================================== */

#ifndef __HP_MANAGER_H__
#define __HP_MANAGER_H__

// =============== インクルード ===================
#include "HpUI.h"

// =============== 定数定義 =======================
#define MAX_HP	(5)		// HPの最大数

// =============== クラス定義 =====================
class CHpManager
{
public:
	// ===メンバ関数宣言===
	CHpManager(const int*);		// コンストラクタ
	~CHpManager();				// デストラクタ
	void Update();				// 更新処理
	void Draw();				// 描画処理
private:
	// ===メンバ変数宣言===
	CHpUI* m_pUI[MAX_HP];		// HPのテクスチャ用ポインタ
	const int* m_pnPlayerHp;	// プレイヤーのHP用ポインタ
};

#endif	// !__HP_MANAGER_H__
