/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	HPテクスチャ表示用ヘッダ
	------------------------------------
	HpUI.h
	------------------------------------
	作成者	仁枝潤哉

	変更履歴
	・2023/11/16 新規作成 仁枝潤哉

========================================== */

#ifndef __HP_UI_H__
#define __HP_UI_H__

// =============== インクルード ===================
#include "Texture.h"

// =============== クラス定義 =====================
class CHpUI
{
public:
	// ===メンバ関数宣言===
	CHpUI();
	~CHpUI();
	void Update();
	void Draw(float, float, float, float);
private:
	// ===メンバ変数宣言===
	Texture* m_pTexture;
	bool m_bDisp;
};

#endif	// !__HP_UI_H__
