/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	アイテムの親クラスh
	------------------------------------
	item.h
	------------------------------------
	作成者 yamashita

	変更履歴
	・2023/11/27 h作成 yamashita
	・2024/02/09 カメラ削除 takagi

========================================== */

#ifndef __ITEM_H__
#define __ITEM_H__

// =============== インクルード ===================
#include "Object.h"

class CItem
	:public CObject
{
public:
	CItem();
	virtual ~CItem();
};

#endif // !__ITEM_H__
