/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	タイトル用オープニング実装
	---------------------------------------
	OpeningTitle.cpp
	---------------------------------------
	作成者	takagi

	変更履歴
	・2023/12/16 制作 takagi
	・2024/01/21 コメント改修 takagi

========================================== */

// =============== インクルード ===================
#include "OpeningTitle.h"	//自身のヘッダ
#include "Defines.h"		//画面情報用
#include "Pos3d.h"
#include "DiType.h"

// =============== 定数定義 ===================
const TPos3d<float> SCALE(static_cast<float>(SCREEN_WIDTH),
	static_cast<float>(SCREEN_HEIGHT), 0.0f);		//大きさ
const int MAX_ANIM(1);								//アニメーション数
const TDiType<int> MAX_SEAT(1);						//1x1

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
COpeningTitle::COpeningTitle()
	:CTitleAnime(MAX_ANIM, MAX_SEAT,0,100)	//委譲	//TODO:この第三引数以降はアニメ実装時に消す事(アニメーションの代わりに停止するためにおいているため)
{
	// =============== 初期化 ===================
	SetSize(SCALE);	//大きさ初期化
}

/* ========================================
	デストラクタ
	----------------------------------------
	内容：破棄時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
COpeningTitle::~COpeningTitle()
{
}