/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	ポーズ用ピクセルシェーダー
	------------------------------------
	PsPose.hlsl
	------------------------------------
	作成者	takagi

	変更履歴
	・2023/11/18 制作 takagi
	・2023/11/19 18の続き takagi
	・2023/11/20 整理 takagi
	・2023/12/01 2dPolygonに適する形に変更 takagi

========================================== */

// =============== 構造体定義 =====================
struct PS_IN
{
	float4 fPos : SV_POSITION;	//位置情報
	float2 fUv : TEXCOORD0;		//テクスチャ情報
	float4 fColor : COLOR0;		//色情報
};	//受け取る情報

// =============== バッファ =====================
Texture2D Tex : register(t0);		//テクスチャ
SamplerState Samp : register(s2);	//フェード用サンプラーステート

/* ========================================
	メイン関数
	-------------------------------------
	内容：ピクセル毎に描く色の情報を設定する
	-------------------------------------
	引数1：PS_IN PsIn：頂点シェーダーから受け取る情報
	-------------------------------------
	戻値：そのピクセルに表示する色情報(rgba)
=========================================== */
float4 main(PS_IN PsIn) : SV_TARGET
{
	// =============== 更新 =====================
	float2 fUv = (PsIn.fUv - 0.5f) * 2.0f;	//UV座標更新
	float2 fPos = float2(0.0f, 0.0f);		//位置初期化
	float4 fColor = float4(PsIn.fColor.x, PsIn.fColor.y, PsIn.fColor.z,
		min(max(distance(fUv, fPos) - 0.24f, 0.0f), Tex.Sample(Samp, PsIn.fUv).w));	//グラデーションのかかった、ぼやけた四隅

	// =============== 提供 =====================
	return fColor;	//確定した色
}