/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	乱数生成定義
	------------------------------------
	Random.h
	------------------------------------
	作成者	takagi

	変更履歴
	・2023/11/28 制作 takagi

========================================== */
/* ========================================
	存在意義
	------------------------------------
	基本#include <random>の機能をそのまま使うが、
	不確定な(=シード値によって確定しない)乱数生成器であるstd::random_deviceの()演算子が乱数を生成するとき処理が重くなるので、
	それを使用して作る疑似乱数生成器のstd::mt19937を静的に確保しておくために存在。
========================================== */
//MIGHT_DO:シードシーケンスの適用？

#ifndef ___RANDOM_H___	//Random.hインクルードガード
#define ___RANDOM_H___

// =============== インクルード ===================
#include <random>	//乱数生成

// =============== クラス定義 ===================
class CRandom
{
public:
	static std::mt19937& GetEngine();	//乱数器取得
private:
	static std::random_device ms_Seed;	//非決定的にシード値生成
	static std::mt19937 ms_Engine;		//シード値にしたがって作成される乱数
};	//乱数生成

#endif // !___RANDOM_H___