/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	リザルトシーン用ヘッダ
	---------------------------------------
	SceneResult.h
	---------------------------------------
	作成者 仁枝潤哉

	変更履歴
	・2023/11/17	新規制作 仁枝潤哉

========================================== */

#ifndef __SCENE_RESULT_H__
#define __SCENE_RESULT_H__

// =============== クラス定義 =====================
class CSceneResult	//リザルトシーン
{
public:
	CSceneResult();
	~CSceneResult();
	void Draw();
};

#endif	//!__SCENE_RESULT_H__
