/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	影表示用クラス定義
	---------------------------------------
	Shadow.h
	---------------------------------------
	作成者 nieda

	変更履歴
	・2023/11/27 制作 nieda
	・2024/01/20 リファクタリング takagi
	・2024/01/21 コメント改修 takagi
	・2024/01/22 リファクタリング takagi

========================================== */

#ifndef __SHADOW_H__	//Shadow.hインクルードガード
#define __SHADOW_H__

// =============== インクルード ===================
#include "2dObject.h"	//親のヘッダ

// =============== クラス定義 =====================
class CShadow :public C2dObject	//2Dオブジェクト
{
public:
	CShadow();				// コンストラクタ
	CShadow(float fScale);	// コンストラクタ
	~CShadow();				// デストラクタ
};	//影

#endif	//!__SHADOW_H__
