/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	スライムサイズ4用cpp
	------------------------------------
	Slime_4.cpp
	------------------------------------
	作成者	山下凌佑

	変更履歴
	・2023/11/08 作成 山下凌佑
	・2023/11/08 大きさの定数を定義	山下凌佑
	・2023/11/08 スライムの移動速度を大きさごとに変更する関数を作成	山下凌佑
	・2023/11/08 スライムの移動速度を大きさごとに変更する関数を作成	山下凌佑
	・2023/11/08 コンストラクタでレベルごとのパラメータをセット	山下凌佑
========================================== */

// =============== インクルード ===================
#include "Slime_4.h"

// =============== 定数定義 ===================
const float LEVEL4_SCALE = 4.0f;
const float LEVEL4_SPEED = ENEMY_MOVE_SPEED * 0.85;

/* ========================================
	コンストラクタ関数
	-------------------------------------
	内容：コンストラクタ
	-------------------------------------
	引数1：無し
	-------------------------------------
	戻値：無し
=========================================== */
CSlime_4::CSlime_4()
{
	m_scale = { LEVEL4_SCALE,LEVEL4_SCALE ,LEVEL4_SCALE };
	m_sphere.radius = LEVEL4_SCALE;
	m_eSlimeSize = E_SLIME_LEVEL::LEVEL_4;
}

/* ========================================
	デストラクタ関数
	-------------------------------------
	内容：デストラクタ
	-------------------------------------
	引数1：
	-------------------------------------
	戻値：
=========================================== */
CSlime_4::~CSlime_4()
{
}

/* ========================================
	スピード決定関数
	-------------------------------------
	内容：スライムの移動速度を設定
	-------------------------------------
	引数1：なし
	-------------------------------------
	戻値：なし
=========================================== */
void CSlime_4::SetSpeed()
{
	m_fSpeed = LEVEL4_SPEED;	//移動速度に定数をセット
}



