/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	スライムサイズ1用cpp
	------------------------------------
	Slime_1.cpp
	------------------------------------
	作成者	澤田

	変更履歴
	・2023/11/08 作成 澤田蒼生
	・2023/11/08 大きさの定数を定義	山下凌佑
	・2023/11/08 スライムの移動速度を大きさごとに変更する関数を作成	山下凌佑
	・2023/11/08 スライムの移動速度を大きさごとに変更する関数を作成	山下凌佑
	・2023/11/08 コンストラクタでレベルごとのパラメータをセット	山下凌佑
========================================== */

// =============== インクルード ===================
#include "Slime_1.h"

// =============== 定数定義 ===================
const float LEVEL1_SCALE = 1.0f;
const float LEVEL1_SPEED = ENEMY_MOVE_SPEED;

/* ========================================
	コンストラクタ関数
	-------------------------------------
	内容：コンストラクタ
	-------------------------------------
	引数1：無し
	-------------------------------------
	戻値：無し
=========================================== */
CSlime_1::CSlime_1()
{
	m_scale = { LEVEL1_SCALE,LEVEL1_SCALE ,LEVEL1_SCALE };
	m_sphere.radius = LEVEL1_SCALE;
	m_eSlimeSize = E_SLIME_LEVEL::LEVEL_1;
}

/* ========================================
	コンストラクタ関数(座標指定)
	-------------------------------------
	内容：コンストラクタ
	-------------------------------------
	引数1：生成する座標
	-------------------------------------
	戻値：無し
=========================================== */
CSlime_1::CSlime_1(TPos3d<float> pos)
{
	m_pos = pos;			// 初期座標を指定
	m_sphere.pos = pos;
	m_scale = { LEVEL1_SCALE,LEVEL1_SCALE ,LEVEL1_SCALE };
	m_sphere.radius *= LEVEL1_SCALE;
	m_eSlimeSize = E_SLIME_LEVEL::LEVEL_1;
}

/* ========================================
	デストラクタ関数
	-------------------------------------
	内容：デストラクタ
	-------------------------------------
	引数1：
	-------------------------------------
	戻値：
=========================================== */
CSlime_1::~CSlime_1()
{
}

/* ========================================
	スピード決定関数
	-------------------------------------
	内容：スライムの移動速度を設定
	-------------------------------------
	引数1：なし
	-------------------------------------
	戻値：なし
=========================================== */
void CSlime_1::SetSpeed()
{
	m_fSpeed = LEVEL1_SPEED;	//移動速度に定数をセット
}



