/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	スフィア用ヘッダ
	---------------------------------------
	SphereInfo.h
	
	作成者	山下凌佑
	
	変更履歴
	・2023/11/04 変更内容：CSphereInfoクラス作成 変更者名：山下凌佑
	・2023/11/04 変更内容：Sphere構造体を作成 変更者名：山下凌佑
	・2023/11/04 変更内容：距離を返す関数を作成 変更者名：山下凌佑
	・2023/11/04 変更内容：角度を返す関数を作成を作成 変更者名：山下凌佑

=========================================== */
#ifndef __SPHEREINFO_H__
#define __SPHEREINFO_H__

#include "TriType.h"

// =============== クラス定義 =====================
class CSphereInfo
{
public:
	CSphereInfo() {}	//コンストラクタ
	~CSphereInfo() {}	//デストラクタ

	// =============== 構造体定義 =====================
	typedef struct Sphere {
		TTriType<float> pos;
		float radius;

		/* ========================================
		関数：Distance
		----------------------------------------
		内容：引数との距離を測る関数
		----------------------------------------
		引数1：測りたい相手のSphere構造体
		----------------------------------------
		戻値：距離
		======================================== */
		float Distance(CSphereInfo::Sphere Obj) {
			return sqrt(pow(Obj.pos.x - this->pos.x, 2.0f) +
						pow(Obj.pos.y - this->pos.y, 2.0f) +
						pow(Obj.pos.z - this->pos.z, 2.0f));
		}

		/* ========================================
		関数：Angle
		----------------------------------------
		内容：引数との角度を取得
		----------------------------------------
		引数1：測りたい相手のSphere構造体
		----------------------------------------
		戻値：角度
		======================================== */
		float Angle(CSphereInfo::Sphere Obj) {
			return atan((Obj.pos.z - this->pos.z) / (Obj.pos.x - this->pos.x));
		}
	};
private:
	
};

#endif // !__SPHEREINFO_H__
