/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	スフィア用ヘッダ
	---------------------------------------
	SphereInfo.h
	
	作成者	山下凌佑
	
	変更履歴
	・2023/11/07 変更内容：Distance関数とAngle関数の中身を.hから.cppに移動

=========================================== */
#include "SphereInfo.h"


/* ========================================
	関数：Distance
	----------------------------------------
	内容：引数との距離を測る関数
	----------------------------------------
	引数1：測りたい相手のSphere構造体
	----------------------------------------
	戻値：距離
======================================== */
float CSphereInfo::Sphere::Distance(CSphereInfo::Sphere Obj)
{
	return sqrt(pow(Obj.pos.x - this->pos.x, 2.0f) +
		pow(Obj.pos.y - this->pos.y, 2.0f) +
		pow(Obj.pos.z - this->pos.z, 2.0f));
}

/* ========================================
関数：Angle
----------------------------------------
内容：引数との角度を取得
----------------------------------------
引数1：測りたい相手のSphere構造体
----------------------------------------
戻値：角度
======================================== */
float CSphereInfo::Sphere::Angle(CSphereInfo::Sphere Obj)
{
	return atan2((Obj.pos.z - this->pos.z) , (Obj.pos.x - this->pos.x));
}