/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	球定義
	------------------------------------
	Sphere.h
	------------------------------------
	作成者	takagi

	変更履歴
	・↓まで 学校の配布物(授業に沿い変形)
	・2023/11/05 制作 takagi
	・2023/11/09 インクルードガード修正 takagi
	・2023/11/10 Uninit静的化 takagi
	・2024/01/21 コメント改修 takagi

========================================== */

#ifndef __SPHERE_H__	//Sphere.hインクルードガード
#define __SPHERE_H__

// =============== インクルード ===================
#include "Geometry.h"	//親のヘッダ

// =============== クラス定義 =====================
class CSphere :public CGeometry	//形状
{
	//static const int CIRCLE_DETAIL = 16;
public:
	// ===プロトタイプ宣言===
	CSphere();				//コンストラクタ
	CSphere(CSphere& Obj);	//コピーコンストラクタ
	~CSphere();				//デストラクタ
	void Draw();			//描画
};	//球

#endif	//!__SPHERE_H__