/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	スフィア用ソース
	---------------------------------------
	SphereInfo.cpp
	---------------------------------------
	作成者	yamashita
	
	変更履歴
	・2023/11/07 変更内容：Distance関数とAngle関数の中身を.hから.cppに移動
	・2023/11/14 変更内容：継承・修正 takagi
	・2024/01/21 コメント改修 takagi

=========================================== */

// =============== インクルード ===================
#include "SphereInfo.h"	

tagSphereInfo::tagSphereInfo(const float &Radius, const TPos3d<float> &Shift)
	:fRadius(Radius)
	,fShift(Shift)
{
}
///* ========================================
//	関数：Distance
//	----------------------------------------
//	内容：引数との距離を測る関数
//	----------------------------------------
//	引数1：測りたい相手のSphere構造体
//	----------------------------------------
//	戻値：距離
//======================================== */
//float tagSphereInfo::Distance(tagSphereInfo& Obj)
//{
//	return sqrt(pow(Obj.pos.x - this->pos.x, 2.0f) +
//		pow(Obj.pos.y - this->pos.y, 2.0f) +
//		pow(Obj.pos.z - this->pos.z, 2.0f));
//}

/* ========================================
	当たり判定位置取得関数
	-------------------------------------
	内容：自身の位置と当たり判定のズレを反映した値を取得
	-------------------------------------
	引数1：TPos3d<float> fPos：表示位置
	-------------------------------------
	戻値：当たり判定の位置
=========================================== */
TPos3d<float> tagSphereInfo::GetCollisionPos(TPos3d<float> fPos)
{
	// =============== 提供 =============
	return (fPos + fShift);
}