/* ========================================
	HEW/UniBoooom!!
	------------------------------------
	Timer用ヘッダ
	------------------------------------
	Timer.h
	------------------------------------
	作成者
		鄭宇恩
	変更履歴
	・2023/11/14 h,作成 Tei

========================================== */
#ifndef __TIMER_H__
#define __TIMER_H__

// =============== インクルード ===================


// =============== クラス定義 =====================
class CTimer
{
public:
	// ===プロトタイプ宣言===
	CTimer();
	~CTimer();
	void Update();
	void Draw();

	int GetTime() { return m_nTimeCnt; }

private:
	// ===メンバ変数宣言===
	int m_nTimeCnt;
};


#endif // __TIMER_H__