/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	タイトル用終了コマンド実装
	---------------------------------------
	TitleCommandFinish.cpp

	作成者	takagi

	変更履歴
	・2024/02/02 制作 takagi
	・2024/02/05 制作進行 takagi

========================================== */

// =============== インクルード ===================
#include "TitleCommandFinish.h"	//自身のヘッダ
#include "Defines.h"			//画面情報用

// =============== 定数定義 ===================
const TPos3d<float> POS{ static_cast<float>(SCREEN_WIDTH) / 2.0f, 260.0f - 120.0f, 0.0f };	//位置
const std::string TEXTURE_FILE = "Assets/Texture/Pause/Pause_Finish.png";							//テクスチャファイル名

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CTitleCommandFinish::CTitleCommandFinish()
	:CTitleCommand(E_STATE_UNSELECTED)	//非選択状態として委譲
{
	// =============== 初期化 ===================
	SetPos(POS);						//位置初期化
	SetTexture(TEXTURE_FILE.c_str());	//テクスチャ登録
}

/* ========================================
	デストラクタ
	----------------------------------------
	内容：破棄時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CTitleCommandFinish::~CTitleCommandFinish()
{
}