/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	タイトル用背景実装
	---------------------------------------
	TitleBgBase.cpp

	作成者	takagi

	変更履歴
	・2023/12/16 制作 takagi
	・2023/12/17 最初拡大され徐々に縮小するように takagi
	・2024/02/05 リファクタリング takagi

========================================== */

// =============== インクルード ===================
#include "TitleBgBase.h"	//自身のヘッダ
#include "Defines.h"		//画面情報用

// =============== 定数定義 ===================
const TPos3d<float> POS{ static_cast<float>(SCREEN_WIDTH) / 2.0f, static_cast<float>(SCREEN_HEIGHT) / 2.0f, 0.0f };	//位置
const TPos3d<float> SCALE(static_cast<float>(SCREEN_WIDTH),	static_cast<float>(SCREEN_HEIGHT), 0.0f);				//小さいときの大きさ
const std::string TEXTURE_FILE = "Assets/Texture/Title/TitleBg.png";												//テクスチャファイル名

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CTitleBgBase::CTitleBgBase()
{
	// =============== 初期化 ===================
	SetPos(POS);						//位置初期化
	SetSize(SCALE);						//大きさ初期化
	SetTexture(TEXTURE_FILE.c_str());	//テクスチャ登録
}

/* ========================================
	デストラクタ
	----------------------------------------
	内容：破棄時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CTitleBgBase::~CTitleBgBase()
{
}