/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	タイトル用2Dオブジェ定義
	---------------------------------------
	TitleObj.h

	作成者	takagi

	変更履歴
	・2023/12/16 制作 takagi
	・2023/12/17 ChackPutOut()関数追加・引数参照化 takagi
	・2024/02/05 リファクタリング takagi

========================================== */

#ifndef __TITLE_OBJ_H__	//TitleObj.hインクルードガード
#define __TITLE_OBJ_H__

// =============== インクルード =====================
#include "2dPolygon.h"	//親のヘッダ

// =============== クラス定義 =====================
class CTitleObj :public C2dPolygon	//平面オブジェ
{
public:
	// ===プロトタイプ宣言===
	CTitleObj();			//コンストラクタ
	virtual ~CTitleObj();	//デストラクタ
};	//タイトル用オブジェ

#endif	//!__TITLE_OBJ_H__