/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	UNION実装
	---------------------------------------
	Union.cpp
	---------------------------------------
	作成者	takagi

	変更履歴
	・2023/12/20 制作 takagi
	・2023/12/24 サイズ・フレーム変更をマネージャへ takagi
	・2024/01/11 ブレンドステート修正に伴う透明度調整 takagi
	・2024/01/20 リファクタリング takagi
	・2024/01/21 コメント改修 takagi
	・2024/01/22 リファクタリング・Draw()関数const化 takagi

========================================== */

// =============== インクルード ===================
#include "Union.h"		//自身のヘッダ
#include "Defines.h"	//画面情報用

// =============== 定数定義 ===================
const float MAX_MOVE(0.04f);	//高さ減少量

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：const int & nFrame：存在するフレーム数
	----------------------------------------
	戻値：なし
=========================================== */
CUnion::CUnion(const int & nFrame)
	:m_pCnt(nullptr)					//縮小用カウンタ
{
	// =============== 初期化 ===================
	m_pCnt = new CFrameCnt(nFrame);	//カウント開始
}

/* ========================================
	デストラクタ
	----------------------------------------
	内容：破棄時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CUnion::~CUnion()
{
}

/* ========================================
	更新関数
	----------------------------------------
	内容：更新処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
void CUnion::Update()
{
	// =============== 更新 ===================
	C2dObject::Update();	//親の関数使用
	if (m_pCnt)	//ヌルチェック
	{
		--*m_pCnt;	//カウントダウン
		if (m_pCnt->IsFin())
		{
			delete m_pCnt;		//メモリ解放
			m_pCnt = nullptr;	//空アドレス代入
		}
		else
		{
			m_Transform.fPos.y += MAX_MOVE * m_pCnt->GetRate();	//位置更新
			SetAlpha(m_pCnt->GetRate());						//透明度更新
		}
	}
}

/* ========================================
	描画関数
	-------------------------------------
	内容：描画処理
	-------------------------------------
	引数：なし
	-------------------------------------
	戻値：なし
=========================================== */
void CUnion::Draw() const
{
	if(m_pCnt)	//ヌルチェック
	{
		// =============== 描画 ===================
		C2dObject::Draw();	//親の関数使用
	}
}

/* ========================================
	終了確認関数
	-------------------------------------
	内容：終了確認
	-------------------------------------
	引数：なし
	-------------------------------------
	戻値：このオブジェクトの役目が終了したか
=========================================== */
bool CUnion::IsFin()
{
	if (m_pCnt)	//ヌルチェック
	{
		// =============== 提供 ===================
		return false;	//カウンタが存在する
	}
	else
	{
		// =============== 提供 ===================
		return true;	//カウンタが存在しない
	}
}