/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	使用中カメラ定義
	---------------------------------------
	UsingCamera.cpp

	作成者	takagi

	変更履歴
	・2024/02/06 ファイル作成 takagi
	・2024/02/08 制作開始 takagi

========================================== */

// =============== インクルード =====================
#include "UsingCamera.h"	//自身のヘッダ

// =============== グローバル変数宣言 =====================
const std::shared_ptr<CCameraDef> CUsingCamera::ms_pDefCamera = std::make_shared<CCameraDef>();	//デフォルトのカメラ
std::weak_ptr<CCamera> CUsingCamera::ms_pUsingCamera;											//使用中のカメラ

/* ========================================
	自身提供関数
	----------------------------------------
	内容：自身を唯一つのみ存在させ、そのアドレスを提供する
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：自身のアドレス
=========================================== */
CUsingCamera& CUsingCamera::GetThis()
{
	// =============== 生成 =====================
	static CUsingCamera UsingCamera;	//自身のインスタンスを生成

	// =============== 提供 =====================
	return UsingCamera;	//生成された自身のアドレスを提供
}

/* ========================================
	カメラ提供関数
	----------------------------------------
	内容：使用中のカメラがnullptrでないときそれを提供し、そうでないときはデフォルトのものを代替として提供する
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：使用中のカメラ
=========================================== */
const std::shared_ptr<CCamera> CUsingCamera::GetCamera() const
{
	// =============== 提供 =====================
	if (ms_pUsingCamera.lock())	//ヌルチェック
	{
		return ms_pUsingCamera.lock();	//使用中のカメラ提供
	}
	else
	{
		return ms_pDefCamera;	//デフォルトのカメラ提供
	}
}

/* ========================================
	カメラ登録関数
	----------------------------------------
	内容：引数で受け取ったカメラを使用中のカメラとして登録する
	----------------------------------------
	引数1：std::shared_ptr<CCamera> pCamera：使用するカメラ
	----------------------------------------
	戻値：なし
=========================================== */
void CUsingCamera::SetCamera(std::shared_ptr<CCamera> pCamera)
{
	// =============== 登録 =====================
	ms_pUsingCamera = pCamera;	//カメラ登録
}

/* ========================================
	コンストラクタ
	----------------------------------------
	内容：生成時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CUsingCamera::CUsingCamera()
{
}

/* ========================================
	コピーコンストラクタ
	----------------------------------------
	内容：複製時に行う処理
	----------------------------------------
	引数1：const CUsingCamera& Obj：コピー元
	----------------------------------------
	戻値：なし
=========================================== */
CUsingCamera::CUsingCamera(const CUsingCamera& Obj)
{	//Nothing to do
}

/* ========================================
	代入演算子
	----------------------------------------
	内容：複製に行う処理
	----------------------------------------
	引数1：const CUsingCamera& Obj：コピー元
	----------------------------------------
	戻値：何もしていない自身の参照
=========================================== */
CUsingCamera & CUsingCamera::operator=(const CUsingCamera & Obj)
{
	// =============== 提供 =====================
	return *this;	//自身の参照
}

/* ========================================
	デストラクタ
	----------------------------------------
	内容：破棄時に行う処理
	----------------------------------------
	引数1：なし
	----------------------------------------
	戻値：なし
=========================================== */
CUsingCamera::~CUsingCamera()
{
}