/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	Zソート描画実装
	---------------------------------------
	ZSort.cpp
	---------------------------------------
	作成者	takagi

	変更履歴
	・2024/01/24 制作 takagi

========================================== */

// =============== インクルード ===================
#include "ZSort.h"		//自身のヘッダ
#include <algorithm>	//ソート用

/* ========================================
	Zソート描画関数
	-------------------------------------
	内容：引数で受け取った描画物をZ値でソートし奥のものから描画する
	-------------------------------------
	引数1：std::vector<const CObject*>& Object：描画物
	-------------------------------------
	戻値：無し
=========================================== */
void CZSort::DrawWithZSort(std::vector<const CObject*>& pObject)
{
	// =============== Zソート =====================
	std::sort(pObject.begin(), pObject.end(), [](const CObject* pFirst, const CObject* pSecond)->bool {
		return pFirst && pSecond					//ヌルチェック
			? pFirst->GetPosZ() > pFirst->GetPosZ()	//奥のものから描画(等価の場合は入れ替えない)
			: false;								//片方はnullなので比較する必要がない
	});	//オブジェクトのソート

	// =============== 3D空間描画 =====================
	for_each(pObject.begin(), pObject.end(), [](const CObject* pObject)->void {
		if (pObject)	//ヌルチェック
		{
			pObject->Draw();	//描画
		}
	});	//ソート順に描画
}