/* ========================================
	HEW/UniBoooom!!
	---------------------------------------
	Zソート描画定義
	---------------------------------------
	ZSort.h
	---------------------------------------
	作成者	takagi

	変更履歴
	・2024/01/24 制作 takagi

========================================== */

#ifndef __Z_SORT_H__	//ZSort.hインクルードガード
#define __Z_SORT_H__

// =============== インクルード =====================
#include "Object.h"	//メンバのヘッダ
#include <vector>	//連想型配列

// =============== クラス定義 =====================
class CZSort
{
public:
	// ===プロトタイプ宣言===
	static void DrawWithZSort(std::vector<const CObject*>& pObject);	//Zソート描画法
};	//Zソート描画

#endif	//!__Z_SORT_H__